app/controllers/images_controller.rb

INSERT INTO `images` (`created_at`, `updated_at`) VALUES ('2018-06-10 04:54:23', '2018-06-10 04:54:23')
UPDATE `images` SET `updated_at` = '2018-06-10 04:54:23' WHERE `images`.`id` = 4
---
  def create
    @image = Image.create!(image_params)
    @image.file.attach(params[:image][:file])
    @image.save!

SELECT  `images`.* FROM `images` WHERE `images`.`id` = 4 LIMIT 1
---
  def show
    @image = Image.find(params[:id])