app/controllers/labels_controller.rb

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 17 LIMIT 1
SELECT COUNT(*) FROM `images`
SELECT  `images`.* FROM `images` ORDER BY `images`.`id` ASC LIMIT 1 OFFSET 22
SELECT  `images`.* FROM `images` WHERE `images`.`id` = NULL LIMIT 1
---
  def new
    # Pega uma imagem dentro do projeto passado como argumento
    if (params[:id])
      @project = Project.find(params[:id])
      @image = @project.images.sample

    # Pega uma imagem aleatória
    else
      count = Image.count
      redirect_to '/' and return if count == 0
      random_offset = rand(count)
      @image = Image.offset(random_offset).first
    end

    # Busca uma pergunta e as respostas possíveis pra aquela pergunta
    if (@image)
      @question = Question.where('project_id = ?', @image.project_id).sample