app/controllers/posts_controller.rb

INSERT INTO `posts` (`author`, `title`, `description`, `created_at`, `updated_at`) VALUES ('bruno', 'bruno #1', 'brunasnalksas', '2018-06-08 19:28:11', '2018-06-08 19:28:11')
---
    def create
#      render plain: params[:post].inspect
      @post = Post.new(post_params)
      @post.author = current_user.username
      if(@post.save)

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `title` = 'IA22', `description` = 'pocpocpokpoc', `updated_at` = '2018-05-06 02:42:29' WHERE `posts`.`id` = 6
---
    def update
      @post = Post.find(params[:id])

      if(@post.update(post_params))

SELECT `posts`.* FROM `posts`
---
    def dashboard
      @posts = Post.all