app/controllers/projects_controller.rb

    def show
      @project = Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

    def create
      # Cria um Projeto, altera o seu user_id pro id do usuário e salva na DB.
      # Em caso de sucesso, faz upload das imagens e redireciona pra página de pergunta.
      @project = Project.new(project_params)
      @project.user_id = current_user.id
      if (@project.save)
          params[:project][:files].each { |upload|
            @image = @project.images.create()
            @image.file.attach(upload)
            @image.save!
---
INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `user_id`, `description`) VALUES ('IA3', '2018-06-10 17:13:52', '2018-06-10 17:13:52', 1, 'laksaksa')
INSERT INTO `images` (`created_at`, `updated_at`, `project_id`) VALUES ('2018-06-10 17:32:28', '2018-06-10 17:32:28', 11)
INSERT INTO `images` (`created_at`, `updated_at`, `project_id`) VALUES ('2018-06-10 18:05:32', '2018-06-10 18:05:32', 17)
UPDATE `images` SET `updated_at` = '2018-06-10 18:05:32' WHERE `images`.`id` = 21