app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.rank = "user"

    # Salvou na DB? Guarda o user.id e redireciona pro index
    if(@user.save)
---
INSERT INTO `users` (`username`, `email`, `encrypted_password`, `salt`, `name`, `organization`, `rank`, `created_at`, `updated_at`) VALUES ('bruno', 'bruno@bruno.com', '$2a$10$UN1QVrw8cSqVCictaXshoeVpRzXbqBsXiHrGxJm9.Bb9YbYBcgIiC', '$2a$10$UN1QVrw8cSqVCictaXshoe', 'brunonome', 'brunera', 'user', '2018-06-08 19:28:02', '2018-06-08 19:28:02')

  def show
    # busca usuário na db
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def settings
    # busca usuário na db
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def edit
    # busca usuário na db
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    # busca usuário na db
    @user = User.find(session[:user_id])
    # salvou na db?
    if(@user.update(user_params))
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `username` = 'mfanger', `salt` = '$2a$10$IeBoYFiv6liPv2aVmNV1DO', `encrypted_password` = '$2a$10$IeBoYFiv6liPv2aVmNV1DOHttXZPOd365Kkj/rndTup.qAwuGJTfq', `updated_at` = '2018-05-18 13:35:57' WHERE `users`.`id` = 1