app/models/user.rb

  def self.authenticate(username_or_email="", login_password="")
  if  EMAIL_REGEX.match(username_or_email)
    user = User.find_by_email(username_or_email)
  else
    user = User.find_by_username(username_or_email)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'bruno@bruno.com' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'nina' LIMIT 1